# https://github.com/tmuxinator/tmuxinator/issues/563
tap "homebrew/cask-fonts"

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'getantibody/tap/antibody'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutls'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install Binaries
brew 'git'
# https://stackoverflow.com/questions/16950130/osx-bundler-install-command-not-found
brew 'rbenv'
brew 'ruby-build'

# https://hub.github.com/
# intel
brew 'hub'
brew 'imagemagick'
brew 'deno'
brew 'mas' # https://github.com/mas-cli/mas
brew 'fd' # https://github.com/sharkdp/fd
brew 'starship'
brew 'k6'

# M1 abaiable
brew 'tree'
brew 'mackup'
brew 'trash'
brew 'wget'
brew 'tmux'
brew 'autojump'
brew 'htop'
brew 'postgresql'
brew 'pyenv'
brew 'tmuxinator'

# node.js
brew 'yarn'

# Apps
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'alfred'
cask 'firefox'
cask 'google-drive-file-stream'
cask 'iterm2'
cask 'teamviewer'
cask 'skype'
cask 'slack'
cask 'github'
cask 'zeplin'
cask 'opera'


# Fonts
cask 'font-fira-code'
# cask 'font-hack'
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'ㅒ