 # Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'prisma/prisma'
# https://github.com/tmuxinator/tmuxinator/issues/563

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'getantibody/tap/antibody'
# brew 'antigen'
# brew 'zsh-completions'
# brew 'zsh-autosuggestions'
# brew 'zsh-syntax-highlighting'
# brew 'salmanulfarzy/spaceship-prompt/spaceship-prompt'


# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
# https://stackoverflow.com/questions/16950130/osx-bundler-install-command-not-found
brew 'rbenv'
brew 'ruby-build'

# https://hub.github.com/
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'trash'
brew 'wget'
brew 'tmux'
brew 'autojump'
brew 'htop'
brew 'imagemagick'
brew 'mas' # https://github.com/mas-cli/mas
brew 'fd' # https://github.com/sharkdp/fd
brew 'prisma'
brew 'postgresql'
cask 'now'
cask 'google-cloud-sdk'


# node.js
brew 'yarn'

# Apps
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'alfred'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'goofy'
cask 'google-drive-file-stream'
cask 'iterm2'
cask 'visual-studio-code'
cask 'teamviewer'
cask 'skype'
cask 'slack'
cask 'github'
cask 'docker'
cask 'graphql-playground'
cask 'zeplin'
cask 'opera'


# Fonts
cask 'font-fira-code'
cask 'font-hack'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'